<template>
  <div class="tm-container-for-content-page">
   <div class="title-main-page">Мои проекты</div>
    <div class="container-for-projects">
      <div class="container-for-filters-for-projects">
        <div style="color: #889ABD;margin: 0 16px 0 12px">Статус</div>
        <div
            @click="filter(1)"
            class="filter-for-projects"
            style="border-radius: 50px 0 0 50px"
            :style="{background: focusIndex===1 ? '#4F8AFD': '',
                       color: focusIndex!==1 ? '#2CCF11': '#FFFFFF'}">
          <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M7.05469 0C6.47762 0 5.99233 0.399383 5.86004 0.936168C4.52479 1.19826 3.30671 1.89894 2.40259 2.93213C1.4175 4.05781 0.875 5.50249 0.875 7C0.875 7.22652 1.05864 7.41016 1.28516 7.41016C1.51167 7.41016 1.69531 7.22652 1.69531 7C1.69531 5.70125 2.16573 4.44845 3.01993 3.47233C3.78716 2.59555 4.81455 1.99462 5.94245 1.75618C6.13998 2.17238 6.5642 2.46094 7.05469 2.46094C7.73317 2.46094 8.28516 1.90895 8.28516 1.23047C8.28516 0.551988 7.73317 0 7.05469 0Z" :fill="focusIndex===1 ? '#FFFFFF': '#2CCF11'"/>
            <path d="M10.5154 6.25535C10.4163 6.18636 10.2276 6.07729 10.093 6.01918L9.88066 5.50648C9.93308 5.37436 9.99039 5.16297 10.0124 5.04082C10.0361 4.90864 9.99365 4.77321 9.89868 4.67824L9.32179 4.10134C9.22682 4.00635 9.09136 3.96389 8.95921 3.98768C8.83892 4.0093 8.62889 4.06566 8.49354 4.11936L7.98085 3.90698C7.92463 3.77677 7.81566 3.5866 7.74468 3.48458C7.66801 3.37433 7.54223 3.30859 7.40794 3.30859H6.59209C6.4578 3.30859 6.33202 3.37433 6.25535 3.48458C6.18636 3.58375 6.07729 3.77245 6.01918 3.90698L5.50648 4.11936C5.37436 4.06695 5.16297 4.00963 5.04082 3.98768C4.90872 3.96397 4.77321 4.00641 4.67824 4.10134L4.10134 4.67824C4.00638 4.77321 3.96391 4.90864 3.98768 5.04082C4.0093 5.16111 4.06566 5.37113 4.11936 5.50648L3.90698 6.01918C3.77677 6.0754 3.5866 6.18436 3.48458 6.25535C3.37433 6.33202 3.30859 6.4578 3.30859 6.59209V7.40794C3.30859 7.54223 3.37433 7.66801 3.48458 7.74468C3.58375 7.81367 3.77245 7.92274 3.90698 7.98085L4.11936 8.49354C4.06695 8.62567 4.00963 8.83706 3.98768 8.95921C3.96391 9.09139 4.00638 9.22682 4.10134 9.32178L4.67824 9.89868C4.77318 9.99365 4.90856 10.0361 5.04082 10.0124C5.16111 9.99072 5.37113 9.93437 5.50648 9.88066L6.01918 10.093C6.0754 10.2233 6.18436 10.4134 6.25535 10.5154C6.33202 10.6257 6.4578 10.6914 6.59209 10.6914H7.40794C7.54223 10.6914 7.66801 10.6257 7.74468 10.5154C7.81367 10.4163 7.92274 10.2276 7.98085 10.093L8.49354 9.88066C8.62567 9.93308 8.83706 9.99039 8.95921 10.0124C9.09139 10.0361 9.22682 9.99365 9.32179 9.89868L9.89868 9.32178C9.99365 9.22682 10.0361 9.09139 10.0124 8.95921C9.99072 8.83892 9.93437 8.62889 9.88066 8.49354L10.093 7.98085C10.2233 7.92463 10.4134 7.81566 10.5154 7.74468C10.6257 7.66801 10.6914 7.54223 10.6914 7.40794V6.59209C10.6914 6.4578 10.6257 6.33202 10.5154 6.25535ZM7 8.64068C6.09536 8.64068 5.35938 7.9047 5.35938 7.00005C5.35938 6.09541 6.09536 5.35943 7 5.35943C7.90464 5.35943 8.64062 6.09541 8.64062 7.00005C8.64062 7.9047 7.90464 8.64068 7 8.64068Z" :fill="focusIndex===1 ? '#FFFFFF': '#2CCF11'"/>
            <path d="M12.7137 6.58984C12.4872 6.58984 12.3036 6.77348 12.3036 7C12.3036 8.29875 11.8332 9.55155 10.979 10.5277C10.2117 11.4044 9.18435 12.0054 8.05645 12.2438C7.85892 11.8276 7.43471 11.5391 6.94421 11.5391C6.26573 11.5391 5.71375 12.0911 5.71375 12.7695C5.71375 13.448 6.26573 14 6.94421 14C7.52128 14 8.00657 13.6006 8.13886 13.0638C9.47411 12.8017 10.6922 12.1011 11.5963 11.0679C12.5814 9.94219 13.1239 8.49751 13.1239 7C13.1239 6.77348 12.9403 6.58984 12.7137 6.58984Z" :fill="focusIndex===1 ? '#FFFFFF': '#2CCF11'"/>
          </svg>
          <span style="margin-left: 4px">Активный</span>
        </div>
        <div
            @click="filter(2)"
            class="filter-for-projects"
            style="color: #EC1B1B"
            :style="{background: focusIndex===2 ? '#4F8AFD': '',
                       color: focusIndex!==2 ? '#EC1B1B': '#FFFFFF'}">
          <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M14 7C14 10.864 10.864 14 7 14C3.136 14 0 10.864 0 7C0 6.167 0.154 5.376 0.42 4.634L1.736 5.11C1.519 5.698 1.4 6.335 1.4 7C1.4 10.087 3.913 12.6 7 12.6C10.087 12.6 12.6 10.087 12.6 7C12.6 3.913 10.087 1.4 7 1.4C6.335 1.4 5.705 1.519 5.117 1.736L4.641 0.413C5.383 0.154 6.174 0 7 0C10.864 0 14 3.136 14 7ZM2.45 3.5C3.031 3.5 3.5 3.031 3.5 2.45C3.5 1.869 3.031 1.4 2.45 1.4C1.869 1.4 1.4 1.869 1.4 2.45C1.4 3.031 1.869 3.5 2.45 3.5ZM4.9 4.9V9.1H6.3V4.9H4.9ZM7.7 4.9V9.1H9.1V4.9H7.7Z" :fill="focusIndex===2 ? '#FFFFFF': '#EC1B1B'"/>
          </svg>
          <span style="margin-left: 4px">Приостановлен</span>
        </div>
        <div
            @click="filter(3)"
            class="filter-for-projects"
            style="color: #889ABD;border-radius: 0 50px 50px 0"
            :style="{background: focusIndex===3 ? '#4F8AFD': '',
                       color: focusIndex!==3 ? '#889ABD': '#FFFFFF'}">
          <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M9.20796 2.04464C8.13938 1.56851 6.94552 1.45056 5.80442 1.70837C4.66332 1.96619 3.63614 2.58596 2.87606 3.47526C2.11597 4.36455 1.66372 5.47572 1.58675 6.64304C1.50978 7.81037 1.81221 8.9713 2.44893 9.9527C3.08566 10.9341 4.02258 11.6834 5.11994 12.0888C6.2173 12.4942 7.41632 12.5341 8.53817 12.2024C9.66002 11.8707 10.6446 11.1852 11.345 10.2482C12.0455 9.31125 12.4243 8.17295 12.425 7.00309V6.43999C12.425 6.05339 12.7384 5.73999 13.125 5.73999C13.5116 5.73999 13.825 6.05339 13.825 6.43999V7.00349C13.8241 8.47525 13.3476 9.90771 12.4664 11.0865C11.5851 12.2653 10.3465 13.1276 8.93512 13.5449C7.52376 13.9622 6.01532 13.9121 4.63476 13.402C3.25421 12.892 2.07551 11.9494 1.27447 10.7147C0.473422 9.48003 0.0929453 8.0195 0.189782 6.55093C0.286619 5.08236 0.855581 3.68444 1.81181 2.56565C2.76805 1.44686 4.06031 0.667143 5.49589 0.342794C6.93146 0.0184452 8.43342 0.166839 9.77776 0.765844C10.1309 0.92319 10.2896 1.33701 10.1323 1.69014C9.97492 2.04327 9.56109 2.20199 9.20796 2.04464Z" :fill="focusIndex===3 ? '#FFFFFF': '#889ABD'"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M13.6197 1.6081C13.8932 1.88133 13.8934 2.32454 13.6202 2.59805L7.49522 8.72917C7.36396 8.86055 7.18588 8.9344 7.00017 8.93444C6.81446 8.93449 6.63634 8.86074 6.50502 8.72942L4.66752 6.89192C4.39415 6.61855 4.39415 6.17534 4.66752 5.90197C4.94089 5.6286 5.3841 5.6286 5.65747 5.90197L6.99975 7.24425L12.6298 1.60859C12.903 1.33509 13.3462 1.33487 13.6197 1.6081Z" :fill="focusIndex===3 ? '#FFFFFF': '#889ABD'"/>
          </svg>
          <span style="margin-left: 4px">Завершен</span>
        </div>
      </div>
      <button class="button-for-add-task" @click="$store.commit('isShowProjectWindow')">Добавить проект</button>
    </div>
    <div class="project-now">
      <tmProject
          @click.native="$store.commit('showProject',project.id)"
          v-for="(project,index) in projectFiltered"
          :project="project"
          :key="index"/>
    </div>
 </div>
</template>

<script>
import tmProject from './tm-project-now'
import {mapGetters} from 'vuex'
export default {
  name: "tm-projects",
  components: {
    tmProject
  },
  data() {
    return {
      projectFiltered: [],
      focusIndex: ''
    }
  },
  methods: {
    filter(index) {
      if (this.focusIndex==index) {
        this.focusIndex = '';
        this.projectFiltered = this.PROJECTS;
      }
      else {
        this.focusIndex=index;
        this.projectFiltered = this.PROJECTS.filter(val => {
          return val.project_status == index;
        })
      }
    }
  },
  computed: {
    ...mapGetters([
        'PROJECTS'
    ])
  },
  mounted() {
    this.$store.dispatch('getAllProjects');
    this.projectFiltered=this.PROJECTS;
  },
  watch: {
    PROJECTS() {
      this.projectFiltered=this.PROJECTS;
    }
  }
}
</script>

<style>
.container-for-filters-for-projects {
  display: flex;
  align-items: center;
}
.container-for-projects {
  display: flex;
  justify-content: space-between;
  align-items: center;
  margin-bottom: 24px;
}
.filter-for-projects {
  margin-right: 2px;
  display: flex;
  align-items: center;
  background: white;
  font-weight: 600;
  font-size: 0.85rem;
  padding: 5px 6px;
  box-shadow: 0 0 10px rgba(2, 57, 164, 0.13);
  cursor: pointer;
}
</style>